results/20251229_170439_envoy_passthrough/runs/run_1.txt
Running 1m test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.24ms    1.62ms  32.30ms   74.75%
    Req/Sec     3.48k   378.74     4.61k    72.71%
  Latency Distribution
     50%    7.01ms
     75%    8.07ms
     90%    9.17ms
     99%   12.27ms
  830138 requests in 1.00m, 10.63GB read
Requests/sec:  13831.94
Transfer/sec:    181.29MB