results/20251229_170439_envoy_passthrough/runs/run_2.txt
Running 1m test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.69ms    1.92ms  30.87ms   74.13%
    Req/Sec     3.27k   486.06     4.66k    70.33%
  Latency Distribution
     50%    7.38ms
     75%    8.66ms
     90%   10.09ms
     99%   13.91ms
  781271 requests in 1.00m, 10.00GB read
Requests/sec:  13017.31
Transfer/sec:    170.61MB